In [1]:
import pandas as pd

df=pd.read_csv("raw_data.csv")

In [2]:
df2=df.copy()
df2=df2.drop_duplicates()
df2=df2.fillna(0)
df2=df2.sort_values("income")

df2=df2.reset_index(drop=True)
df2.to_csv("sorted_data.csv")

In [3]:
#grouping and aggregation

df.groupby("country")["income"].mean()

country
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         NaN
USA       55400.0
Name: income, dtype: float64

In [4]:
df.groupby("gender")["income"].mean()

gender
Female     65666.666667
Male       54800.000000
Unknown    47000.000000
Name: income, dtype: float64

In [6]:
df.groupby("country")["income"].agg(["mean","min","max","std"])

            mean      min      max          std
country
Canada   62000.0  62000.0  62000.0          NaN
China    51000.0  51000.0  51000.0          NaN
India    73000.0  73000.0  73000.0          NaN
Mexico   45000.0  45000.0  45000.0          NaN
Spain        NaN      NaN      NaN          NaN
USA      55400.0  47000.0  62000.0  5504.543578

In [8]:
df.groupby("country")["income"].aggregate(minimum="min", maximum="max")

         minimum  maximum
country
Canada   62000.0  62000.0
China    51000.0  51000.0
India    73000.0  73000.0
Mexico   45000.0  45000.0
Spain        NaN      NaN
USA      47000.0  62000.0

In [9]:
df.groupby("country").agg({
    "income":"mean",
    "age":"mean"
})

          income   age
country
Canada   62000.0   NaN
China    51000.0  27.0
India    73000.0  45.0
Mexico   45000.0   NaN
Spain        NaN  34.0
USA      55400.0  29.5